## 기말 시험

기말 시험은 총 40점으로, 각 문항의 배점은 5점 입니다. 

Kaggle에 있는 실제 데이터셋으로 기말시험을 수행해보려고 합니다.  
본 데이터셋은 Titanic 데이터셋으로, 타이타닉에 탑승한 승객들에 대한 정보를 담고 있으며, 해당 승객이 살았는지 사망했는지에 대한 정보 또한 담고 있습니다. 

데이터에 대한 자세한 사항은 다음 링크를 참고하세요
https://www.kaggle.com/c/titanic/data?select=train.csv

In [1]:
import pandas as pd
import numpy as np

### 1. 데이터 읽기

#### 1-1 `train.csv` 데이터를 읽어온 후 1) 데이터의 행과 열의 갯수 및 2) 기초 통계값을 출력해 봅시다. `describe` method 활용 (5점)

In [5]:
df=pd.read_csv(r'C:\Users\kr937\Desktop\drive\2023\Pyrhon 심화\train.csv')
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 2. Data Query 하기

#### 2-1 사고에서 생존한 사람은 총 몇명인가요? 생존한 사람만 추출하여 새로운 데이터프레임으로 할당해 봅시다. (5점)

`Survived` 컬럼의 정보를 이용해야 합니다. 0은 사망한 사람을, 1은 생존할 사람을 나타냅니다.

In [16]:
df_survived = df[df['Survived'] == 1]
len(df_survived)

342

#### 2-2 나이가 15살 이하인 사람과 60살 이상이 사람들 중에 생존한 사람들을 각각 출력해봅시다, 또한 두 나이그룹의 생존자 차이를 구해봅시다 (5점)

In [19]:
age15 = df_survived[df_survived['Age'] <= 15]

In [20]:
age60 = df_survived[df_survived['Age'] >= 60]

In [23]:
abs(len(age60) - len(age15))

42

두 그룹의 차이는 42명 입니다

#### 2-3 전체 데이터(제일 처음 불러온 데이터)를 `Age` 컬럼을 기준으로 나이가 많은 순에서 적은 순으로 정렬해 봅시다. 나이가 가장 많은 10명의 데이터 프레임을 출력해봅시다. (5점)

In [26]:
df.sort_values("Age", ascending=False).head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q

#### 2-4 Pclass는 해당 승객이 묵었던 객실의 등급을 나타냅니다. 1등석, 2등석, 3등석에 탑승한 승객이 각각 몇명인지 출력하시오. (5점)

In [27]:
for i in range(3):
    print('pclass', i+1,':',len(df[df.Pclass == i+1]))

pclass 1 : 216
pclass 2 : 184
pclass 3 : 491

### 3. Pandas를 사용해 원하는 함수 구현하기

#### 3.1 위의 타이타닉 데이터에서, 아래 컬럼들만 추출하고, 아래 조건을 만족하는 새로운 데이터 프레임을 만들어봅시다.  (5점)

- 추출컬럼: `Name`, ,`Pclass`,`Fare`, `Survived`  
- 조건: 
    1) 생존자만 추출
    2) index를 reset 하여야 함 (`drop` option은 `True`로 지정)

In [42]:
new_df = df[['Name', 'Pclass', 'Fare','Survived']][df['Survived'] == 1]
new_df

,Name,Pclass,Fare,Survived
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,71.2833,1
2,"Heikkinen, Miss. Laina",3,7.9250,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,53.1000,1
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,11.1333,1
9,"Nasser, Mrs. Nicholas (Adele Achem)",2,30.0708,1
...,...,...,...,...
875,"Najib, Miss. Adele Kiamie ""Jane""",3,7.2250,1
879,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",1,83.1583,1
880,"Shelley, Mrs. William (Imanita Parrish Hall)",2,26.0000,1
887,"Graham, Miss. Margaret Edith",1,30.0000,1
889,"Behr, Mr. Karl Howell",1,30.0000,1

#### 3.2 위의 생존자 데이터를 활용해서 구명보트에 태울 사람을 1명을 뽑는 함수를 만들고자 합니다. 함수가 실행될 때 마다 임의의 사람 이름이 출력되어야 합니다 (5점)

In [61]:
def pop_people():
    
    # 내용 입력
    length =new_df.shape[0]
    rand_num=np.random.randint(0,length)
    name=new_df.iloc[rand_num]["Name"]
    print(f"축하합니다! {name} 가 구명보트에 탑승합니다.")

위 함수가 실행되면 아래처럼 출력이 되어야 합니다.

In [68]:
pop_people()

축하합니다! Bissette, Miss. Amelia 가 구명보트에 탑승합니다.

#### 3.3 위의 함수를 반복적으로 5번 실행하여 아래 `people_list`에 보트에 탑승할 5명의 사람의 이름을 넣어봅시다. (5점) 

> 주의할 점은 한번 당첨이 되어 보트에 탑승했다면 그 사람은 다시 뽑히지 않도록 해주어야 합니다.  
> Hint: `append` method를 활용해야 합니다.  
> Hint: `isin` 을 활용해 `people_list`에 있는 사람들을 기존 데이터에서 제거한 후 랜덤 출력을 해주어야 합니다.

In [1]:
people_list = []

def pop_people_update():
    
    # 내용 입력
    for i in range(5):
        length =new_df.shape[0]
        rand_num=np.random.randint(0,length)
        name=new_df.iloc[rand_num]["Name"]
        people_list.append(name)
        #list_series = pd.Series(people_list)
        #if list_series.isin([people_list]):
        #   people_list.drop(name)
    print(f"축하합니다! {name} 가 구명보트에 탑승합니다.")

In [2]:
pop_people_update()

NameError: name 'new_df' is not defined

In [ ]:
people_list

['Beesley, Mr. Lawrence',
 'Johnson, Master. Harold Theodor',
 'Moubarek, Master. Halim Gonios ("William George")',
 'Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")',
 'Bjornstrom-Steffansson, Mr. Mauritz Hakan']